Revit 2027 API
ParameterTypeId.BoundaryXRotationFixed Property
 "X Rotation - Fixed"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryXRotationFixed { get; }
Public Shared ReadOnly Property BoundaryXRotationFixed As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryXRotationFixed {
	ForgeTypeId^ get ();
}
static member BoundaryXRotationFixed : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace